<?php

return [
    /*----------------------------------------*
     * CRUD
     *----------------------------------------*/

    "create"  => "新規作成",
    "store"   => "登録",
    "show"    => "詳細",
    "edit"    => "編集",
    "update"  => "更新",
    "destroy" => "削除",

    /*----------------------------------------*
     * Action
     *----------------------------------------*/

    "open"     => "開く",
    "close"    => "閉じる",
    "back"     => "戻る",
    "cancel"   => "キャンセル",
    "confirm"  => "確認",
    "send"     => "送信",
    "submit"   => "送信",
    "save"     => "保存",
    "search"   => "検索",
    "reset"    => "リセット",
    "clear"    => "クリア",
    "download" => "ダウンロード",
    "upload"   => "アップロード",
    "import"   => "インポート",
    "export"   => "エクスポート",
    "input"    => "入力",
    "output"   => "出力",
    "next"     => "次へ",
    "previous" => "前へ",
    "finish"   => "完了",
    "view"     => "表示",
    "preview"  => "プレビュー",
    "select"   => "選択",
    "change"   => "変更",
    "add"      => "追加",
    "remove"   => "削除",
    "copy"     => "コピー",
    "paste"    => "貼り付け",
    "refresh"  => "更新",
    "print"    => "印刷",
    "encrypt"  => "暗号化",
    "decrypt"  => "復号化",

    /*----------------------------------------*
     * State
     *----------------------------------------*/

    "activate"   => "有効にする",
    "deactivate" => "無効にする",
    "publish"    => "公開する",
    "unpublish"  => "非公開にする",

    /*----------------------------------------*
     * Message
     *----------------------------------------*/

    "messages" => [
        "delete" => "本当に削除しますか？",
    ],

    /*----------------------------------------*
     * Etc.
     *----------------------------------------*/

    "info"           => "情報",
    "information"    => "情報",
    "description"    => "説明",
    "details"        => "詳細",
    "setting"        => "設定",
    "settings"       => "設定",
    "config"         => "設定",
    "configs"        => "設定",
    "configuration"  => "設定",
    "configurations" => "設定",
    "preference"     => "設定",
    "preferences"    => "設定",
    "tool"           => "ツール",
    "tools"          => "ツール",
    "option"         => "オプション",
    "options"        => "オプション",
    "help"           => "ヘルプ",
    "support"        => "サポート",
    "supports"       => "サポート",
    "type"           => "タイプ",
    "status"         => "ステータス",
];
